; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	image1 - mode
	thermograph8 - mode
	spectrograph7 - mode
	image5 - mode
	spectrograph2 - mode
	thermograph0 - mode
	image3 - mode
	image6 - mode
	image4 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	Star5 - direction
	GroundStation4 - direction
	Star6 - direction
	Planet7 - direction
	Planet8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 image6)
	(supports instrument0 thermograph8)
	(supports instrument0 image4)
	(supports instrument0 image3)
	(supports instrument0 thermograph0)
	(supports instrument0 spectrograph2)
	(supports instrument0 image5)
	(supports instrument0 spectrograph7)
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet7)
)
(:goal (and
	(pointing satellite0 Planet9)
	(have_image Star6 image6)
	(have_image Star6 spectrograph2)
	(have_image Planet7 thermograph8)
	(have_image Planet7 image6)
	(have_image Planet8 image1)
	(have_image Planet8 image3)
	(have_image Planet8 spectrograph2)
	(have_image Planet9 image1)
	(have_image Planet9 spectrograph7)
	(have_image Planet9 image3)
	(have_image Phenomenon10 thermograph0)
	(have_image Phenomenon10 image3)
	(have_image Phenomenon10 thermograph8)
	(have_image Phenomenon11 image6)
	(have_image Planet12 spectrograph2)
	(have_image Phenomenon13 image6)
	(have_image Phenomenon13 thermograph0)
))

)

; plan
1. (turn_to satellite0 groundstation4 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 groundstation4)
   goals met: 0 of 18
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 18
3. (calibrate satellite0 instrument0 groundstation4)
   added: (calibrated instrument0)
   goals met: 0 of 18
4. (turn_to satellite0 planet8 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 planet8)
   goals met: 0 of 18
5. (take_image satellite0 planet8 instrument0 spectrograph2)
   added: (have_image planet8 spectrograph2)
   goals met: 1 of 18
6. (take_image satellite0 planet8 instrument0 image3)
   added: (have_image planet8 image3)
   goals met: 2 of 18
7. (take_image satellite0 planet8 instrument0 image1)
   added: (have_image planet8 image1)
   goals met: 3 of 18
8. (turn_to satellite0 phenomenon11 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 phenomenon11)
   goals met: 3 of 18
9. (take_image satellite0 phenomenon11 instrument0 image6)
   added: (have_image phenomenon11 image6)
   goals met: 4 of 18
10. (turn_to satellite0 phenomenon10 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon10)
   goals met: 4 of 18
11. (take_image satellite0 phenomenon10 instrument0 thermograph8)
   added: (have_image phenomenon10 thermograph8)
   goals met: 5 of 18
12. (take_image satellite0 phenomenon10 instrument0 thermograph0)
   added: (have_image phenomenon10 thermograph0)
   goals met: 6 of 18
13. (take_image satellite0 phenomenon10 instrument0 image3)
   added: (have_image phenomenon10 image3)
   goals met: 7 of 18
14. (turn_to satellite0 phenomenon13 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon13)
   goals met: 7 of 18
15. (take_image satellite0 phenomenon13 instrument0 image6)
   added: (have_image phenomenon13 image6)
   goals met: 8 of 18
16. (take_image satellite0 phenomenon13 instrument0 thermograph0)
   added: (have_image phenomenon13 thermograph0)
   goals met: 9 of 18
17. (turn_to satellite0 planet12 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 planet12)
   goals met: 9 of 18
18. (take_image satellite0 planet12 instrument0 spectrograph2)
   added: (have_image planet12 spectrograph2)
   goals met: 10 of 18
19. (turn_to satellite0 planet7 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet7)
   goals met: 10 of 18
20. (take_image satellite0 planet7 instrument0 image6)
   added: (have_image planet7 image6)
   goals met: 11 of 18
21. (take_image satellite0 planet7 instrument0 thermograph8)
   added: (have_image planet7 thermograph8)
   goals met: 12 of 18
22. (turn_to satellite0 star6 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star6)
   goals met: 12 of 18
23. (take_image satellite0 star6 instrument0 image6)
   added: (have_image star6 image6)
   goals met: 13 of 18
24. (take_image satellite0 star6 instrument0 spectrograph2)
   added: (have_image star6 spectrograph2)
   goals met: 14 of 18
25. (turn_to satellite0 planet9 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 planet9)
   goals met: 15 of 18
26. (take_image satellite0 planet9 instrument0 image1)
   added: (have_image planet9 image1)
   goals met: 16 of 18
27. (take_image satellite0 planet9 instrument0 image3)
   added: (have_image planet9 image3)
   goals met: 17 of 18
28. (take_image satellite0 planet9 instrument0 spectrograph7)
   added: (have_image planet9 spectrograph7)
   goals met: 18 of 18
